{
  "tagline": "I'm Dylan, a developer, student and enjoyer of cool stuff.",
  "bio": "I spent the first 20 years of my life in Singapore, an island 12,813km away from where I am now in Vancouver, BC. Coming out of high school, I was really interested in the life sciences and envisioned myself pursuing a career in the field, but during my time serving in the military, I re-discovered a passion for building websites and games with code. I found myself spending more and more time outside of our hours of training learning web development and data analytics through online tutorials as I worked on little side projects to show to friends and family members. That passion carried forward with me to university where I became interested in the field of machine learning and ultimately decided to pursue a combined degree in Mathematics and Computer Science at the University of British Columbia (UBC). These days, I continue to work on many little projects in and out of work that help me to explore my interest in how data and software can drive powerful change in the way we experience and interact with the world.",
  "experiences": [
    {
      "organisation": "Metrized Consulting",
      "position": "Junior Machine Learning Engineer",
      "duration": "2023—Present"
    },
    {
      "organisation": "Google Developer Student Club UBC",
      "position": "VP Events & Logistics",
      "duration": "2021—Present"
    },
    {
      "organisation": "University of British Columbia",
      "position": "BSc Mathematics and Computer Science",
      "duration": "2021—Present"
    },
    {
      "organisation": "Computer Science Dept. UBC",
      "position": "Teaching Assistant CPSC 213, Introduction to Computer Systems",
      "duration": "2023"
    },
    {
      "organisation": "Mathematics Dept. UBC",
      "position": "Teaching Assistant MATH 101, Integral Calculus with Applications",
      "duration": "2023"
    },
    {
      "organisation": "Singapore Army",
      "position": "Third Sergeant Military Police Enforcement Unit",
      "duration": "2019—2021"
    }
  ]
}