[
  {
    "id": "1",
    "title": "NBA Face Off",
    "date": "July 2023",
    "description": "Turning NBA player statistics into a card game. NBA Face Off is a multiplayer, web-based card game designed around real-time NBA player statistics. Developed using React, Apollo GraphQL, AWS Lambda, DynamoDB, Serverless, and Python.",
    "image": "/images/face-off.png",
    "technologies": [
      "Apollo GraphQL",
      "AWS",
      "DynamoDB",
      "React",
      "Tailwind",
      "Chakra UI"
    ],
    "description_long": "Inspired by card games like Top Trumps, NBA Face Off, is a web-based card game where players can connect with friends around the world and go head to head in a battle of luck and NBA player knowledge. Using real statistics for the past season of the NBA queried from the nba_api, players compete to take all their opponent's cards by choosing a game statistic which they think their player performed better at than their opponent.",
    "motivations": "Growing up, I could never dribble, shoot and throw passes across the court so it never occurred to me that it would be fun watching other people do it for a living.\n\nI followed e-sports occasionally and loved competing in rock climbing competitions, but it was only after getting sucked into the career of Michael Jordan in The Last Dance during the Christmas of my first year at UBC did I start to see how the narratives of sports can be so captivating.\n\nSince then, following the NBA and learning about different stars and eras has become a big hobby of mine. I love basketball, my friends love basketball and after watching friends obsess over player stats in their fantasy league, I thought it would be fun to turn that obsession with stats into its own game.",
    "features": [
      "Dynamic user interface built with React and Tailwind",
      "Realtime game updates enabled by websocket connections",
      "Internal Apollo GraphQL API for reading and modifying database of game states",
      "Cloud-hosted database of up-to-date player statistics updated regularly with AWS lambda functions"
    ],
    "timeline": [
      {
        "date": "April 22nd 2023",
        "body": "Came up with project idea: \"Top Trumps but for NBA Player Stats\""
      },
      {
        "date": "May 27th 2023",
        "body": "First commit: developing AWS Lambda function for fetching player data"
      },
      {
        "date": "May 30th 2023",
        "body": "Basic game UI designed in Figma and implemented with React and Tailwind"
      },
      {
        "date": "June 26th 2023",
        "body": "Development of GraphQL reducers for managing game state in DynamoDB database"
      },
      {
        "date": "July 13th 2023",
        "body": "Main game logic implemented and first prototype locally tested with friends"
      },
      {
        "date": "July 22nd 2023",
        "body": "First deployment of game via Railway and first online test game with friends"
      }
    ],
    "is_active": true
  },
  {
    "id": "2",
    "title": "Panda Path",
    "date": "May 2023",
    "description": "Providing peace of mind to Vancouver commuters. Panda Path is a mobile application that uses VPD crime data to help users safely get where they want to go. This full-stack project was built with MongoDB and ExpressJS for the backend and React Native for the frontend.",
    "image": "/images/panda-path.png",
    "technologies": [
      "React Native",
      "Google Maps Platform API",
      "MongoDB",
      "Express",
      "Axios",
      "JSON Web Tokens"
    ],
    "description_long": "Built with three friends at StormHacks 2023, Panda Path is a iOS and Android app built with React Native that helps people safely get where they want to go. After entering their destination, users are shown the path that avoids areas thought to be dangerous according to Vancouver Police crime data. Working on the app's backend, I designed and implemented the REST API for managing authentication and user data using Express JS, JSON Web Tokens. Collaborating with the designers on our team, I then worked on turning our design into a dynamic frontend with React Native.",
    "motivations": "A common concern we identified among students going to school in a new city is the fear of ending up in a dangerous part of town while getting around. Our solution was to use Vancouver Police Department crime data to highlight dangerous areas and generate optimal walking paths that avoid those areas. Over 24 hours, we worked through the night to deliver on our idea and this is what we ended up with.",
    "features": [
      "Cross-platform app built with React Native and CSS",
      "REST API for accessing user data built in Express",
      "User access secured using bcrypt encryption and JSON Web Tokens",
      "Path generation and visualisation with the Google Maps Platform API",
      "Database of user data and preferences hosted with MongoDB Atlas"
    ],
    "timeline": [
      {
        "date": "12pm May 20th 2023",
        "body": "24hr countdown begins. Delegation and planning commences"
      },
      {
        "date": "12pm May 21st 2023",
        "body": "After a long night with many problems and little sleep, submission is in!"
      }
    ],
    "is_active": false
  },
  {
    "id": "3",
    "title": "Project Panini",
    "date": "January 2023",
    "description": "Leveraging LLMs to help users come up with their next project idea. Project Panini uses the OpenAI API to turn user interests into full-fledged project ideas. Built with React.",
    "image": "/images/project-panini.jpg",
    "technologies": [
      "OpenAI API",
      "GPT-3.5",
      "React",
      "Material UI"
    ],
    "description_long": "Project Panini a React-based web app that helps developers come up with their next great project idea. We came up with the idea as part of nwHacks 2023 and worked tirelessly through the night to deliver a search-engine-like interface that turns user-entered keywords into fully fledged project ideas. After settling on an idea they like, users can add projects to their dashboard of ongoing projects and plan what they need to work on to get their project to completion.",
    "motivations": "Inspired by the proliferation of LLM powered applications, our team tried to solve a problem faced by many of our peers in computer science: coming up with exciting project ideas to work on and push forward their programming knowledge.",
    "features": [
      "Dynamic user interface powered by React",
      "GPT-3 powered project suggestions unique to your interests",
      "User dashboard for centrally managing project ideas"
    ],
    "timeline": [
      {
        "date": "12pm January 21st 2023",
        "body": "The hackathon kicks off with some brainstorming and planning."
      },
      {
        "date": "12am January 22nd 2023",
        "body": "After a long day of coding, we have a functioning unpolished prototype."
      },
      {
        "date": "12pm May 21st 2023",
        "body": "The project is in! Time to get some sleep."
      }
    ],
    "is_active": false
  }
]